Revit 2027 API
PipeSettings.SetUpFromBottom Property
 The abbreviation of the Set Up from bottom of fitting(SUB) string.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string SetUpFromBottom { get; set; }
Public Property SetUpFromBottom As String
	Get
	Set
public:
property String^ SetUpFromBottom {
	String^ get ();
	void set (String^ value);
}
member SetUpFromBottom : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
PipeSettings Class
Autodesk.Revit.DB.Plumbing Namespace